## Pandas concate() and join () Function 
       The concat() function is used to combine DataFrames or Series along a particular axis (rows or columns).
       - Can combine multiple DataFrames
       - Works vertically (rows) or horizontally (columns)
       - Index can be preserved or reset
    
       The join() function is used to combine DataFrames based on their index or a key column, similar to SQL joins.
        - Joins data using index by default
        - Supports left, right, inner, and outer joins
        - Commonly used when DataFrames have a common index

In [9]:
import pandas as pd

In [10]:
sr1 = pd.Series([1,2,3,4,5])
sr2 = pd.Series([101,102,103,104,105])
sr3 = pd.concat([sr1,sr2])
sr3

0      1
1      2
2      3
3      4
4      5
0    101
1    102
2    103
3    104
4    105
dtype: int64

In [11]:
df_1 = pd.DataFrame({'ID': [1,2,3,4],
'Name': ['A', 'B', 'C','D'],
'Class': [5,6,7,8]})

df_2 = pd.DataFrame({'ID': [5,6,7,8],
'Name': ['E', 'F', 'G', 'H'],
'Class': [9,10,11,12]})

df_3 = pd.concat([df_1,df_2])
df_3

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8
0   5    E      9
1   6    F     10
2   7    G     11
3   8    H     12

### Concate the dataframe by col. wise with [ axis = 1 ]

In [13]:
df_3 = pd.concat([df_1,df_2],axis= 1)    
df_3

   ID Name  Class  ID Name  Class
0   1    A      5   5    E      9
1   2    B      6   6    F     10
2   3    C      7   7    G     11
3   4    D      8   8    H     12

### For Proper index in DF

In [15]:
df_3 = pd.concat([df_1,df_2],ignore_index=True)     
df_3

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8
4   5    E      9
5   6    F     10
6   7    G     11
7   8    H     12

In [16]:
df_3 = pd.concat([df_1,df_2],axis = 1,join="inner")
df_3

   ID Name  Class  ID Name  Class
0   1    A      5   5    E      9
1   2    B      6   6    F     10
2   3    C      7   7    G     11
3   4    D      8   8    H     12

In [17]:
df_3 = pd.concat([df_1,df_2],axis=1, keys=['Table_1','Table_2'])
df_3

  Table_1            Table_2
       ID Name Class      ID Name Class
0       1    A     5       5    E     9
1       2    B     6       6    F    10
2       3    C     7       7    G    11
3       4    D     8       8    H    12

In [18]:
df_m = pd.DataFrame({'Marks': [50,76,34,34,60,34]})
df_4 = pd.concat([df_1,df_m],ignore_index=True)
df_4

    ID Name  Class  Marks
0  1.0    A    5.0    NaN
1  2.0    B    6.0    NaN
2  3.0    C    7.0    NaN
3  4.0    D    8.0    NaN
4  NaN  NaN    NaN   50.0
5  NaN  NaN    NaN   76.0
6  NaN  NaN    NaN   34.0
7  NaN  NaN    NaN   34.0
8  NaN  NaN    NaN   60.0
9  NaN  NaN    NaN   34.0

### Record with non nan value

In [20]:
df_5 = df_1.join(df_m,how = 'inner')    
df_5

   ID Name  Class  Marks
0   1    A      5     50
1   2    B      6     76
2   3    C      7     34
3   4    D      8     34

### Record with all value and also nan values

In [22]:
df_5 = df_1.join(df_m,how = 'outer')    
df_5

    ID Name  Class  Marks
0  1.0    A    5.0     50
1  2.0    B    6.0     76
2  3.0    C    7.0     34
3  4.0    D    8.0     34
4  NaN  NaN    NaN     60
5  NaN  NaN    NaN     34

In [23]:
df_5 = df_1.join(df_m,rsuffix='1')
df_5

   ID Name  Class  Marks
0   1    A      5     50
1   2    B      6     76
2   3    C      7     34
3   4    D      8     34